#### Handle Categorical Features

#### One Hot Encoding

One hot encoding is one method of converting data to prepare it for an algorithm and get a better prediction. With one-hot, we convert each categorical value into a new categorical column and assign a binary value of 1 or 0 to those columns.

In [5]:
import pandas as pd
import numpy as np

In [6]:
df=pd.read_csv("titanic.csv",usecols=["Sex"])

In [7]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [8]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [9]:
df=pd.read_csv("titanic.csv", usecols=["Embarked"])
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [10]:
df.Embarked.value_counts().sort_values(ascending=False).head(20)

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [11]:
df["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [12]:
df.dropna(inplace=True)

In [13]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

#### For more categorical variables

In [14]:
df=pd.read_csv('mercedesbenz.csv', usecols=["X0","X1","X2","X3","X4","X5","X6"])
df.head()

   X0 X1  X2 X3 X4 X5 X6
0  az  v   n  f  d  t  a
1   t  b  ai  a  d  b  g
2  az  v  as  f  d  a  j
3  az  l   n  f  d  z  l
4   w  s  as  c  d  y  i

In [15]:
df.columns

Index(['X0', 'X1', 'X2', 'X3', 'X4', 'X5', 'X6'], dtype='object')

In [16]:
for i in df.columns:
    print(len(df[i].unique()))

49
27
45
7
4
32
12

In [17]:
lst_10=df.X1.value_counts().sort_values(ascending=False).head(10).index
lst_10 = list(lst_10)

In [18]:
lst_10

['aa', 's', 'l', 'b', 'v', 'r', 'i', 'a', 'c', 'o']

In [19]:
for categories in lst_10:
    df[categories]=np.where(df['X1']==categories,1,0)

In [20]:
df[['X1']+lst_10]

      X1  aa  s  l  b  v  r  i  a  c  o
0      v   0  0  0  0  1  0  0  0  0  0
1      b   0  0  0  1  0  0  0  0  0  0
2      v   0  0  0  0  1  0  0  0  0  0
3      l   0  0  1  0  0  0  0  0  0  0
4      s   0  1  0  0  0  0  0  0  0  0
...   ..  .. .. .. .. .. .. .. .. .. ..
4204   h   0  0  0  0  0  0  0  0  0  0
4205  aa   1  0  0  0  0  0  0  0  0  0
4206   v   0  0  0  0  1  0  0  0  0  0
4207   v   0  0  0  0  1  0  0  0  0  0
4208  aa   1  0  0  0  0  0  0  0  0  0

[4209 rows x 11 columns]

In [21]:
df['v']

0       1
1       0
2       1
3       0
4       0
       ..
4204    0
4205    0
4206    1
4207    1
4208    0
Name: v, Length: 4209, dtype: int32